{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "mohammadmahdinouri/llava-gemma-4bit",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "language_model.model.layers.3.mlp.up_proj",
    "language_model.model.layers.10.self_attn.v_proj",
    "language_model.model.layers.2.mlp.down_proj",
    "language_model.model.layers.2.mlp.gate_proj",
    "language_model.model.layers.2.self_attn.k_proj",
    "language_model.model.layers.1.self_attn.k_proj",
    "language_model.model.layers.11.mlp.up_proj",
    "language_model.model.layers.10.self_attn.k_proj",
    "language_model.model.layers.3.mlp.down_proj",
    "language_model.model.layers.14.mlp.down_proj",
    "language_model.model.layers.17.mlp.down_proj",
    "language_model.model.layers.16.mlp.gate_proj",
    "language_model.model.layers.4.mlp.down_proj",
    "language_model.model.layers.15.mlp.gate_proj",
    "language_model.model.layers.6.self_attn.q_proj",
    "language_model.model.layers.10.self_attn.o_proj",
    "language_model.model.layers.12.self_attn.v_proj",
    "language_model.model.layers.17.self_attn.k_proj",
    "language_model.model.layers.17.mlp.up_proj",
    "language_model.model.layers.12.self_attn.k_proj",
    "language_model.model.layers.14.mlp.up_proj",
    "language_model.model.layers.11.self_attn.k_proj",
    "language_model.model.layers.1.self_attn.v_proj",
    "language_model.model.layers.8.self_attn.o_proj",
    "language_model.model.layers.10.mlp.gate_proj",
    "language_model.model.layers.9.self_attn.q_proj",
    "language_model.model.layers.7.self_attn.q_proj",
    "language_model.model.layers.4.self_attn.o_proj",
    "language_model.model.layers.13.self_attn.q_proj",
    "language_model.model.layers.5.self_attn.q_proj",
    "language_model.model.layers.6.mlp.gate_proj",
    "language_model.model.layers.13.mlp.down_proj",
    "language_model.model.layers.6.self_attn.k_proj",
    "language_model.model.layers.4.mlp.up_proj",
    "language_model.model.layers.9.mlp.gate_proj",
    "language_model.model.layers.12.mlp.gate_proj",
    "language_model.model.layers.4.mlp.gate_proj",
    "language_model.model.layers.5.self_attn.v_proj",
    "language_model.model.layers.9.self_attn.v_proj",
    "language_model.model.layers.16.mlp.up_proj",
    "language_model.model.layers.1.self_attn.q_proj",
    "language_model.model.layers.10.self_attn.q_proj",
    "language_model.model.layers.15.self_attn.v_proj",
    "language_model.model.layers.15.mlp.up_proj",
    "language_model.model.layers.0.self_attn.v_proj",
    "language_model.model.layers.12.mlp.down_proj",
    "language_model.model.layers.16.self_attn.o_proj",
    "language_model.model.layers.6.self_attn.v_proj",
    "language_model.model.layers.15.self_attn.k_proj",
    "language_model.model.layers.8.mlp.up_proj",
    "language_model.model.layers.0.self_attn.k_proj",
    "language_model.model.layers.5.mlp.gate_proj",
    "language_model.model.layers.5.self_attn.k_proj",
    "language_model.model.layers.16.self_attn.q_proj",
    "language_model.model.layers.14.mlp.gate_proj",
    "language_model.model.layers.0.self_attn.q_proj",
    "language_model.model.layers.12.mlp.up_proj",
    "language_model.model.layers.16.self_attn.k_proj",
    "language_model.model.layers.17.self_attn.o_proj",
    "language_model.model.layers.13.mlp.up_proj",
    "language_model.model.layers.2.mlp.up_proj",
    "language_model.model.layers.8.self_attn.k_proj",
    "language_model.model.layers.8.mlp.down_proj",
    "language_model.model.layers.8.self_attn.q_proj",
    "language_model.model.layers.11.self_attn.q_proj",
    "language_model.model.layers.6.mlp.down_proj",
    "language_model.model.layers.12.self_attn.o_proj",
    "language_model.model.layers.14.self_attn.o_proj",
    "language_model.model.layers.11.self_attn.o_proj",
    "language_model.model.layers.7.mlp.gate_proj",
    "language_model.model.layers.14.self_attn.q_proj",
    "language_model.model.layers.13.self_attn.v_proj",
    "language_model.model.layers.8.self_attn.v_proj",
    "language_model.model.layers.17.mlp.gate_proj",
    "language_model.model.layers.2.self_attn.o_proj",
    "language_model.model.layers.11.mlp.down_proj",
    "language_model.model.layers.11.mlp.gate_proj",
    "language_model.model.layers.16.mlp.down_proj",
    "language_model.model.layers.5.mlp.up_proj",
    "language_model.model.layers.0.mlp.up_proj",
    "language_model.model.layers.4.self_attn.k_proj",
    "language_model.model.layers.1.mlp.up_proj",
    "language_model.model.layers.3.self_attn.q_proj",
    "language_model.model.layers.15.mlp.down_proj",
    "language_model.model.layers.17.self_attn.v_proj",
    "language_model.model.layers.12.self_attn.q_proj",
    "language_model.model.layers.13.self_attn.o_proj",
    "language_model.model.layers.17.self_attn.q_proj",
    "language_model.model.layers.2.self_attn.v_proj",
    "language_model.model.layers.11.self_attn.v_proj",
    "language_model.model.layers.4.self_attn.v_proj",
    "language_model.model.layers.13.self_attn.k_proj",
    "language_model.model.layers.10.mlp.up_proj",
    "language_model.model.layers.7.mlp.down_proj",
    "language_model.model.layers.5.mlp.down_proj",
    "language_model.model.layers.7.self_attn.o_proj",
    "language_model.model.layers.3.mlp.gate_proj",
    "language_model.model.layers.1.mlp.down_proj",
    "language_model.model.layers.2.self_attn.q_proj",
    "language_model.model.layers.3.self_attn.o_proj",
    "language_model.model.layers.10.mlp.down_proj",
    "language_model.model.layers.8.mlp.gate_proj",
    "language_model.model.layers.1.mlp.gate_proj",
    "language_model.model.layers.0.self_attn.o_proj",
    "language_model.model.layers.6.mlp.up_proj",
    "language_model.model.layers.9.mlp.up_proj",
    "language_model.model.layers.6.self_attn.o_proj",
    "language_model.model.layers.9.mlp.down_proj",
    "language_model.model.layers.7.mlp.up_proj",
    "language_model.model.layers.13.mlp.gate_proj",
    "language_model.model.layers.14.self_attn.k_proj",
    "language_model.model.layers.7.self_attn.v_proj",
    "language_model.model.layers.15.self_attn.q_proj",
    "language_model.model.layers.15.self_attn.o_proj",
    "language_model.model.layers.16.self_attn.v_proj",
    "language_model.model.layers.4.self_attn.q_proj",
    "language_model.model.layers.0.mlp.down_proj",
    "language_model.model.layers.5.self_attn.o_proj",
    "language_model.model.layers.9.self_attn.k_proj",
    "language_model.model.layers.7.self_attn.k_proj",
    "language_model.model.layers.1.self_attn.o_proj",
    "language_model.model.layers.14.self_attn.v_proj",
    "language_model.model.layers.9.self_attn.o_proj",
    "language_model.model.layers.3.self_attn.v_proj",
    "language_model.model.layers.0.mlp.gate_proj",
    "language_model.model.layers.3.self_attn.k_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}